# Grouping & Computing Aggregates

In [1]:
import pandas as pd
import pandas.io.sql as sqlio
import psycopg2

conn = psycopg2.connect("dbname=northwind user=postgres password=password host=localhost port=5433")

### Display a table that counts the number of suppliers from each country.

In [2]:
sql = """
SELECT "Country", count(*)
FROM suppliers
GROUP BY "Country"
"""

data = sqlio.read_sql_query(sql, conn)
data.head(10)

       Country  count
0        Spain      1
1        Italy      2
2       Norway      1
3       Sweden      2
4       France      3
5          USA      4
6  Netherlands      1
7       Brazil      1
8    Australia      2
9           UK      2

### Display

In [3]:
sql = """
SELECT "OrderID", sum("UnitPrice")
FROM order_details
WHERE "ProductID" IN (11, 51, 60)
GROUP BY "OrderID"
"""

data = sqlio.read_sql_query(sql, conn)
data.head(10)

   OrderID   sum
0    10999  53.0
1    10821  53.0
2    10519  34.0
3    10889  21.0
4    10512  34.0
5    10294  27.2
6    11055  53.0
7    10362  42.4
8    10918  34.0
9    10397  42.4

### Display table that counts total amount of Titles

In [4]:
sql = """
SELECT "Title", count(*)
FROM employees
GROUP BY "Title"
"""

data = sqlio.read_sql_query(sql, conn)
data.head(10)

                      Title  count
0     Vice President, Sales      1
1  Inside Sales Coordinator      1
2      Sales Representative      6
3             Sales Manager      1

In [5]:
sql = """
SELECT "ProductName", sum(o."UnitPrice") as SumUnitPrice
from products p right join order_details o
on p."ProductID" = o."ProductID"
group by "ProductName"
order by SumUnitPrice desc
"""

data = sqlio.read_sql_query(sql, conn)
data.head(10)

               ProductName  sumunitprice
0            Côte de Blaye       5902.40
1  Thüringer Rostbratwurst       3713.38
2     Raclette Courdavault       2761.00
3           Tarte au sucre       2227.80
4    Manjimup Dried Apples       1971.60
5   Gnocchi di nonna Alice       1770.80
6        Camembert Pierrot       1638.80
7         Carnarvon Tigers       1612.50
8        Rössle Sauerkraut       1385.20
9             Alice Mutton       1349.40

### Display a table ordering employees with the most orders

In [7]:
sql = """
select count(*), "LastName"
from employees right join orders
on employees."EmployeeID" = orders."EmployeeID"
group by "LastName"
order by count DESC
"""

data = sqlio.read_sql_query(sql, conn)
data.head(10)

   count   LastName
0    156    Peacock
1    127  Leverling
2    123    Davolio
3    104   Callahan
4     96     Fuller
5     72       King
6     67     Suyama
7     43  Dodsworth
8     42   Buchanan

### Display a table of statistics such as min, max, sum, count and avergage for each order